; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj5 - airport
	obj1 obj6 - city
	obj2 - airplane
	obj3 obj9 obj12 obj14 obj15 obj16 - package
	obj4 obj10 obj11 - truck
	obj7 obj8 obj13 - location
)

(:init
	(at obj11 obj0)
	(at obj12 obj0)
	(in-city obj5 obj6)
	(in-city obj0 obj1)
	(in-city obj7 obj6)
	(at obj9 obj5)
	(in-city obj13 obj1)
	(at obj15 obj5)
	(at obj2 obj0)
	(at obj3 obj0)
	(in-city obj8 obj1)
	(at obj10 obj5)
	(at obj14 obj0)
	(at obj16 obj5)
	(at obj4 obj0)
)

(:goal (and
	(at obj14 obj7)
	(at obj16 obj7)
	(at obj9 obj13)
	(at obj15 obj8)
	(at obj12 obj7)
))
)

; plan
1. (drive obj4 obj0 obj13)
   deleted: (at obj4 obj0)
   added: (at obj4 obj13)
   goals met: 0 of 5
2. (load obj2 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj2)
   goals met: 0 of 5
3. (load obj2 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj2)
   goals met: 0 of 5
4. (load obj10 obj16 obj5)
   deleted: (at obj16 obj5)
   added: (in obj16 obj10)
   goals met: 0 of 5
5. (fly obj2 obj0 obj5)
   deleted: (at obj2 obj0)
   added: (at obj2 obj5)
   goals met: 0 of 5
6. (load obj2 obj9 obj5)
   deleted: (at obj9 obj5)
   added: (in obj9 obj2)
   goals met: 0 of 5
7. (load obj2 obj15 obj5)
   deleted: (at obj15 obj5)
   added: (in obj15 obj2)
   goals met: 0 of 5
8. (unload obj2 obj14 obj5)
   deleted: (in obj14 obj2)
   added: (at obj14 obj5)
   goals met: 0 of 5
9. (unload obj2 obj12 obj5)
   deleted: (in obj12 obj2)
   added: (at obj12 obj5)
   goals met: 0 of 5
10. (fly obj2 obj5 obj0)
   deleted: (at obj2 obj5)
   added: (at obj2 obj0)
   goals met: 0 of 5
11. (unload obj2 obj9 obj0)
   deleted: (in obj9 obj2)
   added: (at obj9 obj0)
   goals met: 0 of 5
12. (unload obj2 obj15 obj0)
   deleted: (in obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 5
13. (load obj11 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj11)
   goals met: 0 of 5
14. (load obj11 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj11)
   goals met: 0 of 5
15. (drive obj11 obj0 obj13)
   deleted: (at obj11 obj0)
   added: (at obj11 obj13)
   goals met: 0 of 5
16. (unload obj11 obj9 obj13)
   deleted: (in obj9 obj11)
   added: (at obj9 obj13)
   goals met: 1 of 5
17. (drive obj11 obj13 obj8)
   deleted: (at obj11 obj13)
   added: (at obj11 obj8)
   goals met: 1 of 5
18. (unload obj11 obj15 obj8)
   deleted: (in obj15 obj11)
   added: (at obj15 obj8)
   goals met: 2 of 5
19. (load obj10 obj14 obj5)
   deleted: (at obj14 obj5)
   added: (in obj14 obj10)
   goals met: 2 of 5
20. (load obj10 obj12 obj5)
   deleted: (at obj12 obj5)
   added: (in obj12 obj10)
   goals met: 2 of 5
21. (drive obj10 obj5 obj7)
   deleted: (at obj10 obj5)
   added: (at obj10 obj7)
   goals met: 2 of 5
22. (unload obj10 obj16 obj7)
   deleted: (in obj16 obj10)
   added: (at obj16 obj7)
   goals met: 3 of 5
23. (unload obj10 obj14 obj7)
   deleted: (in obj14 obj10)
   added: (at obj14 obj7)
   goals met: 4 of 5
24. (unload obj10 obj12 obj7)
   deleted: (in obj12 obj10)
   added: (at obj12 obj7)
   goals met: 5 of 5
